Repository: jssmk/asylum
Catalog: project/members/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Membership types
fi: Jäsentyyppi

source: Grants
fi: Pääsyoikeudet

source: Cities
fi: Kaupungit

source: Credit
fi: Saldo

source: Negative credit
fi: Saldo miinuksella

source: Positive credit
fi: Saldo plussalla

source: Credit %d
fi: Saldo %d

source: Name
fi: Nimi

source: Tags
fi: Tägit

source: Approve selected applications
fi: Hyväksy valitut hakemukset

source: I have read and accept <a href="%s" target="_blank">the rules</a>
fi: Olen lukenut ja hyväksyn <a href="%s" target="_blank">säännöt</a>

source: First name
fi: Etunimi

source: Last name
fi: Sukunimi

source: City of residence
fi: Paikkakunta

source: Email address
fi: Sähköpostiosoite

source: Phone number
fi: Puhelinnumero

source: Nickname
fi: Lempinimi

source: Label
fi: Nimiö

source: Member Type
fi: Jäsentyyppi

source: Member Types
fi: Jäsentyypit

source: Date accepted
fi: Hyväksymispäivä

source: Anonymized id (for use in external databases)
fi: Anonymisoitu tunniste (käytettäväksi ulkoisissa tietokannoissa)

source: Member id no
fi: Jäsennumero

source: Member
fi: Jäsen

source: Members
fi: Jäsenet

source: Membership Application Tag
fi: Jäsenhakemuksen tägi

source: Membership Application Tags
fi: Jäsenhakemuksen tägit

source: Application tags
fi: Jäsenhakemuksen tagit

source: Notes
fi: Muistiinpanot

source: Member with this email already exists
fi: Tämä sähköpostiosoite on jo jäsenrekisterissä

source: Membership Application
fi: Jäsenhakemus

source: Membership Applications
fi: Jäsenhakemukset

source: Datetime
fi: Päivä ja aika

source: Note
fi: Muistiinpano

source: Notes about %s on %s
fi: Muistiinpanoja jäsenestä %s ajalla %s

source: Apply for membership
fi: Hae jäseneksi

source: Submit
fi: Lähetä

source: Received. Thank you
fi: Jäsenhakemuksesi on vastaanotettu. Paljon kiitoksia!

source: Application received. Thank you
fi: Jäsenhakemuksesi on vastaanotettu. Paljon kiitoksia!

source: We'll get back to you
fi: Vastaamme sinulle pian.
